import React from 'react'
import { RightOutlined} from '@ant-design/icons';
import './cannotvote.css'
import { Link } from 'react-router-dom'
import { Divider } from 'antd';
const CanNotVote = () => {

    return <div className="can-not-vote">
        
        <p className='page-nav'><Link to='/' style={{ color: 'black' }}>မူလစာမျက်နှာ  <RightOutlined /></Link> <a style={{color:'#aaa', textDecoration:'none'}}>မဲရုံအတွင်းမှာ ဘယ်လိုမဲပေးရမလဲ??</a></p>

        <div className='can-vote-div'>
            <text className='can-not-vote-title'>သင်ဟာ မဲဆန္ဒရှင်တယောက်ဖြစ်တယ်ဆိုရင် ဒီအချက်(၂)ချက်ကိုသေချာမှတ်ထားပါ။</text>
            <ul className="can-not-vote-ul">
                <li>သင့်ရဲ့ဆန္ဒမဲကို လျှို့ဝှက်ထားပါ။</li>
                <li>သင်ဟာ ဆန္ဒမဲသုံးကြိမ် အနည်းဆုံးပေးရပါမယ်။
                    <ul>
                        <li>ပြည်သူ့လွှတ်တော်(အစိမ်းရောင်မဲပုံး)</li>
                        <li>အမျိုးသားလွှတ်တော်(အပြာရောင်မဲပုံး)</li>
                        <li>တိုင်းဒေသကြီး/ပြည်နယ်လွှတ်တော်(ခရမ်းရောင်မဲပုံး)</li>
                        <li>တိုင်းရင်းသားလူမျိုးကိုယ်စားလှယ်(မဲပေးခွင့်ရှိပါက ခရမ်းရောင်မဲပုံးသို့ထည့်ပါ)</li>
                    </ul>
                </li>
            </ul>
            <Divider type='horizontal' />
            <text className='can-not-vote-title'>မဲရုံအတွင်းမှာ ဘယ်လိုမဲပေးရမလဲ??</text>
            <ul className="can-not-vote-ul">
                <li>မဲရုံရှေ့ကမဲစာရင်းမှာ မိမိမဲစာရင်းအမှတ်စဉ်ကိုရှာဖွေ မှတ်သားထားပါ။</li>
                <li>မသန်စွမ်းသူများနဲ့ အကူအညီလိုနေတဲ့ မဲဆန္ဒရှင်များကို ဦးစားပေးပါ။</li>
                <li>လက်မှာ မင်တို့ထားတဲ့ အမှတ်အသားရှိမရှိ မဲရုံလုံခြုံရေးရဲ့ စစ်ဆေးမှုကိုခံယူပါ။</li>
                <li>မဲဆန္ဒရှင်စာရင်းမှာလက်မှတ်ထိုးပြီး သက်ဆိုင်ရာမဲလက်မှတ်ထုတ်ပေးသူဆီမှာ မဲလက်မှတ်ရယူပါ။</li>
                <li>လျှို့ဝှက်ဆန္ဒပြုခန်းအတွင်းသို့ဝင်ပြီး မဲပေးလိုတဲ့ကိုယ်စားလှယ်ဘေးကအကွက်မှာ တကြိမ်သာတံဆိပ်တုံး ထုပြီး ဆန္ဒပြုပါ။</li>
                <li>ဆန္ဒမဲလက်မှတ်ကိုခေါက်ပြီး သက်ဆိုင်ရာဆန္ဒမဲပုံးအတွင်းထည့်ပါ။</li>
                <li>ဆန္ဒမဲပေးသူသည် ဆန္ဒမဲလက်မှတ်ရှိ အမည်များကို မဖတ်တတ်လျှင် သို့မဟုတ် ညွှန်ကြားထားသည့် အတိုင်း ဆန္ဒမဲ မပေးတတ်လျှင် လည်းကောင်း၊ မျက်မမြင် ဖြစ်လျှင် လည်းကောင်း သက်ဆိုင်ရာ မဲစာရင်း၌ ပါရှိသော မဲဆန္ဒရှင်၏ ဖခင်၊ မိခင်၊ ဇနီး၊ ခင်ပွန်း၊ သား၊ သမီး၊ ညီအစ်ကို မောင်နှမ အရင်းတစ်ဦးဦးသည် ဆန္ဒမဲပေးသူက ညွှန်ကြားသည့်အတိုင်း သတ်မှတ်ထားသည့် နေရာတွင် ဆန္ဒမဲ လက်မှတ်၌ လျှို့ဝှက် ဆန္ဒပြုရမည်။ ယင်းပုဂ္ဂိုလ်များ မရှိခဲ့လျှင် မဲရုံမှူးသည် ယင်းပုဂ္ဂိုလ်များ ကိုယ်စား ဆောင်ရွက်ပေးရမည်။ ထို့နောက် ဆန္ဒမဲပေးသူအား ထိုဆန္ဒမဲလက်မှတ်ကို ခေါက်၍ မဲပုံးထဲသို့ ကိုယ်တိုင် ထည့်စေရမည်။</li>
                <li>မဲရုံသို့ လာရောက် ဆန္ဒမဲပေးသူသည် ကျန်းမာ သန်စွမ်းခြင်း မရှိသောကြောင့် မိမိဆန္ဒ ပြုပြီးသော ဆန္ဒမဲလက်မှတ်ကို မဲပုံးထဲသို့ ထည့်နိုင်စွမ်း မရှိလျှင် မဲရုံ အဖွဲ့ဝင်များသည် ထိုသူအား ဆန္ဒမဲထည့်နိုင်စေရန် ကူညီရမည်။</li>
            </ul>
        </div>
    </div>
}

export default CanNotVote;